{
    "about": {
        "name": "O aplikaci"
    },
    "stats": {
        "name": "Statistiky",
        "today": "Dnes",
        "loadData": "Načíst Data",
        "info": "Různé metriky jsou důležitými ukazateli při posuzování funkčnosti navrhovaného algoritmu nebo řešení. V případě této aplikace se sledované parametry týkají dvou oblastí. První je samotná struktura dopravního systému, která se skládá ze zastávek, linek, tras a spojů. Druhou oblastí je samotné zpracování dopravních dat, přičemž nejvíce sledovanými parametry je podíl správně přiřazených a uložených záznamů.",
        "systemStateHead": "Statistiky dopravní sítě",
        "systemStateInfo": "Základem pro zpracování dat o fungování samotného dopravního systému je znalost jeho struktury. Zjednodušeně řečeno, kdy a kde by mělo jet nějaké vozidlo. V podstatě se každý systém hromadné dopravy skládá ze stejné vnitřní struktury. Na samém vrcholu jsou linky, například 1. Každá linka pak obsahuje trasy, což je v podstatě pevné pořadí zastávek. Každá trasa obsahuje spoje, které jsou v podstatě realizací trasy v určitém čase, jinými slovy, je to ta konkrétní šalina, která jede z dané zastávky v určitém čase. Spoje jsou pak propojeny s trasami v prostoru, což je v podstatě jen seznam ulic, kudy trasa linky vede. V případě této aplikace jsou trasy a spoje propojeny, což vychází z navrženého datového modelu, který je podrobněji popsán v části O aplikaci. Následující statistiky ukazují stav systému ve vybraném období.",
        "systemStateActual": "Aktuálně používané",
        "systemStateNew": "Nově přidané",
        "systemStateRoutes": "Linky",
        "systemStateShapes": "Trasy v prostoru",
        "systemStateStops": "Zastávky",
        "systemStateTrips": "Spoje",
        "systemStateProcessingTime": "Jak dlouho trvala aktualizace systému?",
        "systemStateProcessingTimeInfo": "Celá aktualizace struktury dopravního systému spočívá především v tom, že se zkoumá, co se oproti současnému stavu změnilo. Zpravidla více času zaberou změny, při kterých se mění trasy linek v prostoru, což vyžaduje výpočet nových tras v dopravních sítích.",
        "systemStateRouting": "Trasování linek",
        "systemStateRoutingInfo": "Aby bylo možné použít algoritmus zpracování dat, který je podrobně popsán v části O aplikaci, je nutné znát přesnou trasu linky v prostoru dopravní sítě. Zjednodušeně řečeno, kterými křižovatkami a ulicemi má vozidlo projet. Tyto trasy se vypočítávají na základě podkladových dopravních sítí a aktuálního stavu systému hromadné dopravy. Protože se trasy mění méně často než ostatní atributy systému, neprobíhá aktualizace této části systému každý den, takže statistiky z výpočtu tras v reálném prostoru jsou k dispozici pouze pro některé dny.",
        "systemStateRoutingRail": "Železnice",
        "systemStateRoutingRoad": "Autobusy a trolejbusy",
        "systemStateRoutingTram": "Tramvaje",
        "systemStateRoutingType": "Typ trasy",
        "systemStateRoutingSuccess": "Míra úspěšnosti trasování",
        "systemStateRoutingSuccessOk": "Úspěch",
        "systemStateRoutingSuccessNotOk": "Chyba",
        "systemStateRoutingTime": "Jak dlouho trval výpočet tras?",
        "processingDataHead": "Statistiky zpracování provozních dat",
        "processingDataInfo": "Aktuální model dopravního systému je šablonou, z níž se přidáním dat ze skutečného provozu vytvoří obraz reálného chování systému v daný den. Vstup tvoří záznamy z externí databáze, přičemž každý záznam představuje stav vozidla v určitém časovém okamžiku. Vlastní zpracování těchto záznamů tedy spočívá v jejich stažení a následném indexování tak, aby byly co nejvíce komprimovány, aniž by došlo ke ztrátě důležitých metadat, která určují kam tyto záznamy v systému patří. Současně se při indexování redukují záznamy o různé anomálie, jako je pobyt vozidla na konečné zastávce apod. Indexované záznamy jsou pak uloženy a využívány dalšími moduly této aplikace. Dalším důležitým ukazatelem je, kolik naplánovaných spojů v systému obsahuje data, tj. existuje nějaký záznam o průběhu spoje. Jednoduše řečeno, pro daný spoj existuje alespoň jeden záznam odeslaný vozidlem, které spoj realizovalo. Kromě toho existují také záznamy, které popisují neplánované spoje v systému. Míra spojů popsaných těmito záznamy pak ukazuje, jak velká je část systému, pro kterou existují data o skutečném chování.",
        "processingDataTimes": "Jak dlouho trvá zpracování záznamů?",
        "processingDataTimeAll": "Celkový čas",
        "processingDataTimeDownload": "Stahování záznamů",
        "processingDataTimeProcessing": "Indexace záznamů",
        "processingDataDownloadRecords": "Stažené záznamy",
        "processingDataSavedRecords": "Uložené záznamy",
        "processingDataRecordsStats": "Míra redukce záznamů",
        "processingDataDroppedRecords": "Odstraněné záznamy",
        "processingDataPlannedTrips": "Plánované spoje",
        "processingDataExtraTrips": "Mimořádné spoje",
        "processingDataTripsRate": "Úspěšnost indexace spojů",
        "processingDataTripsRateSuccess": "Spoje obsahující data",
        "processingDataTripsRateFail": "Spoje bez dat"
    },
    "shapes" : {
        "name": "Trasy linek",
        "today": "Dnes",
        "loadData": "Načíst Data",
        "route": "Linka",
        "shape": "Trasa",
        "close": "Zavřít",
        "enableZones": "Zobrazit tarifní zóny",
        "enableRouteColor": "Použít barvu linky ze vstupních dat GTFS"
    },
    "delay" : {
        "trips": "Zpoždění spojů",
        "aggMethod": "Agregační metoda",
        "avg": "Průměr",
        "sum": "Součet",
        "max": "Maximum",
        "min": "Minimum",
        "route": "Linka",
        "shape": "Trasa",
        "trip": "Spoj",
        "aggMethodInfo": "Matematická funkce, která se používá při kombinování dat z více dnů.",
        "showDelayLabels": "Zobrazit hodnoty zpoždění",
        "showDelayLabelsInfo": "Zobrazení konkrétních hodnot zpoždění pro jednotlivé segmenty trasy podle vybrané metody agregace.",
        "simplifiedVisualisation": "Zjednodušená analýza zpoždění",
        "simplifiedVisualisationInfo": "Na mapě nejsou zobrazeny všechny dostupné údaje o zpoždění. Aplikace pracuje pouze s datami z příjezdu vozidla na zastávku.",
        "allTrips": "Všechny spoje na trase"
    },
    "map" : {
        "zone": "Zóna",
        "wheelchair": "Zastávka má zvýšenou nástupní hranu",
        "order": "Pořadí zastávky"
    },
    "primeng": {
        "dayNames": ["Neděle", "Pondělí", "Úterý", "Středa", "Čtvrtek", "Pátek", "Sobota"],
        "dayNamesShort": ["Ned", "Pon", "Út", "Stř", "Čtv", "Pát", "Sob"],
        "dayNamesMin": ["Ned","Pon","Út","Stř","Čtv","Pát","Sob"],
        "monthNames": ["Leden","Únor","Březen","Duben","Květen","Červen","Červenec","Srpen","Září","Říjen","Listopad","Prosinec"],
        "monthNamesShort": ["Leden","Únor","Březen","Duben","Květen","Červen","Červenec","Srpen","Září","Říjen","Listopad","Prosinec"],
        "today": "Dnes",
        "weekHeader": "Týd"
    },
    "common": {
        "calendar": "Výběr časového období",
        "route": "Výběr zobrazené trasy",
        "trip": "Výběr spoje",
        "settings": "Nastavení vizualizace"
    },
    "UIMessagesService": {
        "loading": "Načítání dat",
        "toasts": {
            "dbConnectError": {
                "head": "Chyba na straně serveru",
                "body": "Nelze se připojit k serveru. Kontaktujte prosím správce systému."
            },
            "noAvailableDates" : {
                "head": "Nelze načíst žádná data",
                "body": "V databázi nejsou k dispozici žádná data."
            },
            "noAvailableDataForSelection" : {
                "head": "Nejsou k dispozici žádná data",
                "body": "Pro vybraný časový interval nejsou k dispozici žádná data. Zkuste prosím změnit časový interval."
            }
        }
    }
}