{
    "about": {
        "name": "About"
    },
    "stats": {
        "name": "Stats",
        "today": "Today",
        "loadData": "Load Data",
        "info": "Various metrics are important indicators when assessing the performance of a proposed algorithm or solution. In the case of this application, the monitored parameters relate to two areas. The first is the structure of the transport system itself, which consists of stops, lines, routes and services. The second area is the real operation data, with the most monitored parameters being the proportion of correctly matched and stored records.",
        "systemStateHead": "Transport network statistics",
        "systemStateInfo": "The basis for processing data on the functioning of the transport system itself is knowledge of its structure. Simply put, when and where a vehicle should go. Essentially, every public transport system consists of the same internal structure. At the very top are lines, for example 1. Each line then contains routes, which is essentially a fixed order of stops. Each route contains services that are essentially the realization of a route at a particular time, in other words, it is that particular bus that goes from that particular stop at a particular time. The services are then linked to the real-space route, which is basically just a list of streets that the route of the line goes through. In the case of this application, routes and services are linked, based on the proposed data model, which is described in more detail in the About. The following statistics show the state of the system in the selected period.",
        "systemStateActual": "Currently used",
        "systemStateNew": "New added",
        "systemStateRoutes": "Routes",
        "systemStateShapes": "Real-space route",
        "systemStateStops": "Stops",
        "systemStateTrips": "Services",
        "systemStateProcessingTime": "How long did it take to update the system?",
        "systemStateProcessingTimeInfo": "The whole point of updating the structure of the transport system is to look at what has changed from the current situation. As a rule, changes that alter the real-space route take more time, which requires the calculation of new routes in the transport networks.",
        "systemStateRouting": "Line routing",
        "systemStateRoutingInfo": "In order to use the data processing algorithm, which is described in detail in the section About, it is necessary to know the exact route of the line in the transport network space. In simple terms, which crossroads and streets the vehicle has to pass through. These routes are calculated based on the underlying traffic networks and the current state of the public transport system. Because routes change less frequently than other system attributes, this part of the system is not updated every day, so statistics from the real-space route calculation are only available for some days.",
        "systemStateRoutingRail": "Trains",
        "systemStateRoutingRoad": "Buses and trolleybuses",
        "systemStateRoutingTram": "Trams",
        "systemStateRoutingType": "Type of route",
        "systemStateRoutingSuccess": "Routing success rate",
        "systemStateRoutingSuccessOk": "Success",
        "systemStateRoutingSuccessNotOk": "Fail",
        "systemStateRoutingTime": "How long did it take to calculate the routes?",
        "processingDataHead": "Traffic data processing statistics",
        "processingDataInfo": "The actual transport system model is a template from which the actual real operation data is added to create a picture of the real behaviour of the system on a given day. The input consists of records from an external database, with each record representing the state of the vehicle at a specific point in time. The actual processing of these records therefore consists of downloading them and then indexing them so that they are compressed as much as possible without losing the important metadata that determines where these records belong in the system. At the same time, the indexing process reduces the records by various anomalies such as vehicle stay at the final stop, etc. The indexed records are then stored and used by other modules of the application. Another important indicator is how many scheduled connections in the system contain data, i.e. there is some record of the progress of the connection. Simply put, for a given connection there is at least one record sent by the vehicle that carried out the connection. In addition, there are also records that describe unscheduled connections in the system. The rate of connections described by these records then indicates how large is the part of the system for which there is actual behavioural data.",
        "processingDataTimes": "How long does it take to process records?",
        "processingDataTimeAll": "Total time",
        "processingDataTimeDownload": "Downloading records",
        "processingDataTimeProcessing": "Indexing records",
        "processingDataDownloadRecords": "Downloaded records",
        "processingDataSavedRecords": "Saved records",
        "processingDataRecordsStats": "Record reduction rate",
        "processingDataDroppedRecords": "Deleted records",
        "processingDataPlannedTrips": "Scheduled services",
        "processingDataExtraTrips": "Exceptional services",
        "processingDataTripsRate": "Service indexing success rate",
        "processingDataTripsRateSuccess": "Services containing data",
        "processingDataTripsRateFail": "Services without data"
    },
    "shapes" : {
        "name": "Line routes",
        "today": "Today",
        "loadData": "Load Data",
        "route": "Line",
        "shape": "Route",
        "close": "Close"
    },
    "map" : {
        "zone": "Zone"
    },
    "primeng": {
        "dayNames": ["Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"],
        "dayNamesShort": ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"],
        "dayNamesMin": ["Su","Mo","Tu","We","Th","Fr","Sa"],
        "monthNames": ["January","February","March","April","May","June","July","August","September","October","November","December"],
        "monthNamesShort": ["Jan", "Feb", "Mar", "Apr", "May", "Jun","Jul", "Aug", "Sep", "Oct", "Nov", "Dec"],
        "today": "Today",
        "weekHeader": "Wk"
    }
}